#ifndef DATABASE_H
#define DATABASE_H

#include <QtCore/QString>
//#include "../global.h"
typedef int				HFILE;
typedef char				CHAR;
typedef short				SHORT;
typedef int				INT;

typedef unsigned char			BYTE, u8, uchar;
typedef unsigned char			BOOL;
typedef unsigned short			WORD, UINT16,u16;
typedef unsigned int			DWORD, UINT32, u32;
//typedef long				LONG;
typedef unsigned long long		UINT64, u64;

#define TRUE					(1)
#define FALSE					(0)
#define NULL					(0)


#define FLASH_SECTOR_SIZE		0x4000
#define MAKE_SECTOR_SIZE(x)		(((x) + FLASH_SECTOR_SIZE - 1) / FLASH_SECTOR_SIZE * FLASH_SECTOR_SIZE)

//////////////////////////////////////////////////////////////////////////
#define ENROLLDATA_MOUNTPOINT	"."
#define USB_MOUNTPOINT			"/mnt/ext1"
#define SDCARD_MOUNTPOINT		"/mnt/ext2"

//////////////////////////////////////////////////////////////////////////
#define FLASH_LICENSE_SIZE		( FLASH_SECTOR_SIZE )
#define FLASH_LICENSE_FILENAME          (ENROLLDATA_MOUNTPOINT "/LICENSE.set")
#define FLASH_LICENSE_BACKUP            (ENROLLDATA_MOUNTPOINT "/LICENSE-bak.set")
#define FLASH_SETUP_SIZE		(FLASH_SECTOR_SIZE)
#define FLASH_SETUP_FILENAME            (ENROLLDATA_MOUNTPOINT "/SETUP.set")
#define FLASH_SETUP_BACKUP		(ENROLLDATA_MOUNTPOINT "/SETUP-bak.set")
#define FLASH_UI_INDEX_SIZE		( FLASH_SECTOR_SIZE * 2 )
#define FLASH_UI_INDEX_FILENAME         (ENROLLDATA_MOUNTPOINT "/UI_INDEX.dat")
//#define FLASH_FP_INDEX_SIZE		( FLASH_SECTOR_SIZE )

}T_BAUDRATE;

typedef enum
{
        NETSPEED_10MBPS,
        NETSPEED_100MBPS,
}T_NETSPEED;

typedef enum
{
        THEME_1,
        THEME_2,
        THEME_3
}T_THEME;

typedef enum
{
        WIEGAND_26,
        WIEGAND_34,
        WIEGAND_CUSTOM
}T_WIEGANDFORMAT;

typedef enum
{
        DOORSENSOR_TYPE_START,
        DOORSENSOR_TYPE_NONE = DOORSENSOR_TYPE_START,
        DOORSENSOR_TYPE_OPEN,
        DOORSENSOR_TYPE_CLOSE,
        DOORSENSOR_TYPE_END = DOORSENSOR_TYPE_CLOSE
}T_DOORSENSOR_TYPE;

typedef enum
{
        TR_START,
        TR_DUTYNO = TR_START,
    TR_DUTYON,
        TR_DUTYOFF,
        TR_END = TR_DUTYOFF,
        TR_OVERTIMEON,
        TR_OVERTIMEOFF,
        TR_GOOUTON,
        TR_GOOUTOFF,
        TR_IN,
        TR_OUT,
        /*TR_END = TR_OUT,*/
        FUNC_LOGVIEW,
        FUNC_BELL,
        FUNC_ALARM,
        FUNC_SYSINFO
}T_TR_STATUS;

typedef enum
{
        SMSG_START,
        SMSG_ALL = SMSG_START,
        SMSG_USER,
        SMSG_GROUP,
        SMSG_END = SMSG_GROUP
}T_SMSG_TYPE;

typedef enum
{
        VM_START,
        VM_NONE = VM_START,
        VM_ANY = VM_START,
        VM_FP = 1,
        VM_IDPW = 2,
        VM_RF = 3,
        VM_IDFP = 4,
        VM_RFFP = 33,
        VM_RFPW = 34,
        VM_FPPW = 35,
        VM_FPRFPW = 36,
        VM_END = VM_FPRFPW
}T_VERIFY_MODE;

#define MAX_SOUND_COUNT		50
typedef enum
{
        SOUND_START,
        SOUND_DIGIT0 = SOUND_START,
        SOUND_DIGIT1,
        SOUND_DIGIT2,
        SOUND_DIGIT3,
        SOUND_DIGIT4,
        SOUND_DIGIT5,
        SOUND_DIGIT6,
        SOUND_DIGIT7,
        SOUND_DIGIT8,
        SOUND_DIGIT9,
        SOUND_TURNON,
        SOUND_TURNOFF,
        SOUND_PRESSFINGER_1,
        SOUND_PRESSFINGER_2,
        SOUND_PRESSFINGER_3,
        SOUND_TAKEOFF_FP,
        SOUND_PRESSFP_RETRY,
        SOUND_FPENROLL_SUCCESS,
        SOUND_FPENROLL_FAIL,
        SOUND_FPDOUBLED,
        SOUND_INPUT_PWD,
        SOUND_PWD_ERROR,
        SOUND_INPUT_CARD,
        SOUND_CARDDOUBLED_RETRY,
        SOUND_CARDENROLL_SUCCESS,
        SOUND_TALK_YOURNAME,
        SOUND_VOICERECORD_SUCCESS,
        SOUND_VOICERECORD_RETRY,
        SOUND_PREPARE_FOR_PHOTO,
        SOUND_PHOTO_SUCCESS,
        SOUND_CAMERA_TONE,
        SOUND_KEYTONES,
        SOUND_MENUSELECT,
        SOUND_ENTERMENU,
        SOUND_VERIFY_SUCCESS,
        SOUND_VERIFY_FAIL,
        SOUND_ERROR,
        SOUND_QUESTION,
        SOUND_OK,
        SOUND_BELL1,
        SOUND_BELL2,
        SOUND_BELL3,
        SOUND_BELL4,
        SOUND_BELL5,
        SOUND_END = SOUND_BELL5,
        APLUS_OK,
        APLUS_REVERIFY,
}T_SOUND_TYPE;

typedef enum
{
        ANTIPASS_START,
        ANTIPASS_NO = ANTIPASS_START,
        ANTIPASS_MASTER,
        ANTIPASS_SLAVE,
        ANTIPASS_END = ANTIPASS_SLAVE
}T_ANTIPASS_TYPE;

typedef enum
{
        ANTIPASSOUT_NONE = 0,
        ANTIPASSOUT_IN = 1,
        ANTIPASSOUT_OUT = 3
}T_ANTIPASSOUT_TYPE;

//////////////////////////////////////////////////////////////////////////

typedef struct _ENROLLDB_HDR
{
        DWORD dwUIIndexSize;
        DWORD dwFPIndexSize;
        DWORD dwUserInfoSize;
        DWORD dwFPSize;
} T_ENROLLDB_HDR;

typedef struct {
        DWORD	mENROLL		: 24;		// (2bit(used_bit, duress_bit) per FP*10, PWD, CARD)
        DWORD	byUseGroupTZ: 1;		// use group's timezone
        DWORD	byUseGroupVM: 1;		// use group's verify mode
        DWORD	byPhotoExist: 1;		// 1 && sdcard exist => photo exist
        DWORD	byVoiceExist: 1;		// 1 && sdcard exist => voice exist
        DWORD	byMgr		: 3;		// privilege, 001:User, 110:Manager, 111:SManager
        DWORD	bEnable		: 1;		// enable/disable flag
} ALL_FLAG;

typedef union {
        DWORD		dwALL;
        ALL_FLAG	members;
} DATA_FLAG;

typedef struct _user_info
{
        UINT64	ID;			//8
        DATA_FLAG FLAG;		//4
        DWORD	FP;			//4		1 ~ MaxEnrollCount
        DWORD	PWD;		//4
        DWORD	CARD;		//4
        BYTE	UserTZ[3];	//3
        BYTE	TIMEGROUP;	//1, 1 ~ 5
        BYTE	VERIFYMODE;	//1
        BYTE	PART;		//1
        BYTE	RES[2];		//2
        WORD	NAME[USERNAME_LENGTH]; //24
} USER_INFO;			//Total = 56

typedef struct _user_time
{
        DWORD	dwSeconds;	//4
        UINT64	nID;	//8
        //BYTE    vaild; //AA
} USER_TIME;			//Total = 12


#define UI_EXIST_ENROLL(_ui_, _n_)		(((_ui_)->FLAG.members.mENROLL & (1 << ((_n_) << 1))) >> ((_n_) << 1))
#define UI_SET_ENROLL(_ui_, _n_, _v_)	((_ui_)->FLAG.members.mENROLL = ((_ui_)->FLAG.members.mENROLL & ~(1 << ((_n_) << 1))) | (((_v_)?1:0) << ((_n_) << 1)))
#define UI_EXIST_DURESS(_ui_, _n_)		(((_ui_)->FLAG.members.mENROLL & (1 << (((_n_) << 1) + 1))) >> (((_n_) << 1) + 1))
#define UI_SET_DURESS(_ui_,_n_,_v_)		((_ui_)->FLAG.members.mENROLL = ((_ui_)->FLAG.members.mENROLL & ~(1 << (((_n_) << 1) + 1))) | (((_v_)?1:0) << (((_n_) << 1) + 1)))
#define UI_GROUPTZ_STATUS(_ui_)			((_ui_)->FLAG.members.byUseGroupTZ)
#define UI_GROUPVM_STATUS(_ui_)			((_ui_)->FLAG.members.byUseGroupVM)
#define UI_PHOTO_STATUS(_ui_)			((_ui_)->FLAG.members.byPhotoExist)
#define UI_VOICE_STATUS(_ui_)			((_ui_)->FLAG.members.byVoiceExist)
#define UI_MANAGER_STATUS(_ui_)			((_ui_)->FLAG.members.byMgr)
#define UI_ENABLE_STATUS(_ui_)			((_ui_)->FLAG.members.bEnable)
#define UI_ALL_DATA(_ui_)				((_ui_)->FLAG.dwALL)

//////////////////////////////////////////////////////////////////////////
typedef struct SLOG_INFO
{
        DWORD	dwSeconds;	//4
        UINT64	nManagerID;	//8
        UINT64	nUserID;	//8
        BYTE	byAction;	//1
        BYTE	byResult;	//1
        WORD	res;		//2
} MLOG_INFO;			//Total = 24

typedef struct GLOG_INFO
{
        DWORD	dwSeconds;	//4
        UINT64	nID;		//8
        BYTE	byAction;	//1, VerifyMode
        BYTE	byTrStatus;	//1
        BOOL	bAntipassOut;//1
        BYTE	res[1];		//1
} ALOG_INFO;			//Total = 16

typedef struct GLOG_INFO_index
{
        DWORD	dwSeconds;	//4
        UINT64	nID;		//8
        BYTE	byAction;	//1, VerifyMode
        BYTE	byTrStatus;	//1
        BOOL	bAntipassOut;//1
        BYTE	res[1];		//1
        DWORD	dwIndex;	//4//hym//1
} ALOG_INFO_INDEX;			//Total = 16
//////////////////////////////////////////////////////////////////////////
typedef struct _dblicense
{
        DWORD	dwCheckSum;				//4
        DWORD	dwBuildNumber;			//4
        DWORD   dwSystemCheck;          //4
        CHAR	szFirstDate[32];		//32
        CHAR	szSerialNumber[32];		//32
        CHAR	szTradeMark[32];		//32
        CHAR	szProductName[32];		//32
        CHAR	szProductType[32];		//32
        CHAR	szEngineVersion[32];	//32
        CHAR	szFirmwareVersion[32];	//32
        INT		nMaxEnrollCount;		//4
        INT		nBackupNumber;			//4
        BOOL	bUseEthernet;			//1
        BOOL	bUseUSB;				//1
        BOOL	bUseCard;				//1
        BOOL	bUsePOE;				//1
        BOOL	bUseWebServer;			//1
        BOOL	bUseRS232;				//1
        BOOL	bUseMP3;				//1
        BOOL	bUseWiegand;			//1
        BOOL	bUseAlarmFunction;		//1
        BOOL	bUseACFunction;			//1
        BOOL	bLockControl;			//1
        BOOL	bUseCamera;				//1
        INT		nCMOS;					//4
        BYTE	byMACaddr[8];			//8
        BYTE    byTcpipMode;            //1

        DWORD	dwFlashSizeUserInfo;	//4
        DWORD	dwFlashSizeFP;			//4

        INT		nSlogMaxCount;			//4
        DWORD	dwFlashSizeSlog;		//4
        INT		nGlogMaxCount;			//4
        DWORD	dwFlashSizeGlog;

        BOOL      bOnLineEnroll;
} DBLICENSE;						//Total = 140

typedef struct _wiegand_type{
        unsigned char byOEM_len;	// length of OEM code
        unsigned char byFC_len;		// length of the machine no field
        unsigned char byCC_len;		// length of the ID field
        unsigned char byRes;		// reserved
        unsigned int  dwTpw;		// pulse width (micro second)
        unsigned int  dwTpi;		// pulse interval (micro second)
} WIEGAND_TYPE;

typedef struct _dbsetup_nomenu
{
        char	szCompanyNamy[32];		//32
        int		nReadMLogPos;			//4
        int		nReadALogPos;			//4
        DWORD	dwMechanical;			//4
        DWORD	dwExpose;				//4
        BOOL	bDisableDevice;			//1
        BYTE	byDoorStatus;			//1, 0:Off, 1:On, 2:Auto
        BOOL	bSummertimeUpdated;		//1
        BYTE	res[1];					//1
        WIEGAND_TYPE wiegand_type;		//12
} DBSETUP_NOMENU;					//Total = 64

typedef struct _dbsetup_system
{
        int		nTimeFormat;			//4
        int		nDateFormat;			//4
        int		nLanguage;				//4
        int		nVolume;				//4
        BOOL	bVoiceOut;				//1
        BOOL	bKeyTones;				//1
        BYTE	res[2];					//2
        int		nDaylightOffset;		//4
        DWORD	dwDaylightChangeTime;	//4
        DWORD	dwDaylightRestoreTime;	//4
        BYTE	byF1Status;				//1
        BYTE	byF2Status;				//1
        BYTE	byF3Status;				//1
        BYTE	byF4Status;				//1
        BYTE	byF5Status;				//1
        BYTE	byF6Status;				//1
        BYTE	byF7Status;				//1
        BYTE	byF8Status;				//1
        int		nIdletimeForPoweroff;	//4
        int		nIdletimeForSleep;		//4
        int		nIdletimeForLcdswitch;	//4
        DWORD	dwAutoPoweroffTime;		//4
        DWORD	dwAutoPoweronTime;		//4
        DWORD	dwAutoSleepTime;		//4
        BOOL	bPowerkeyLock;			//1
        BOOL	bRS232Use;				//1
        BOOL	bRS485Use;				//1
        BOOL	bUSBSlaveUse;			//1
        int		nMachineID;				//4
        int		nBaudrate;				//4
        DWORD	ipAddress;				//4
        DWORD	ipSubnetMask;			//4
        DWORD	ipDefaultGateway;		//4
        DWORD	ipPCBackground;			//4
        DWORD	dwCommPassword;			//4
        int		nMLogWarning;			//4
        int		nGLogWarning;			//4
        int		nReverifyTime;			//4
        int		nLockTime;				//4
        int		nDoorOpenTime;			//4
        int		nDoorSensorStatus;		//4
        int		nIllegalVerifyWarning;	//4
        int		nManagersNumber;		//4
        int		nVerifyMode;			//4
        DWORD	dwSManagerPwd;			//4
        BOOL	bDHCPUse;				//1
        BOOL	byAntipassStatus;		//1
        BOOL	bPwdAlarmUse;			//1
        BOOL	bSOSKeyUse;				//1
        int		nAlarmDelay;			//4
        int		nLockGroupMain;			//4
        DWORD	dwBindingID;			//4
        BOOL	bEthernetUse;			//1
        BYTE	byNetworkSpeed;			//1
        BYTE	byTheme;				//1
        BYTE	byWiegandFormat;		//1
        BYTE	byDefaultGVM;			//1
        BOOL	bCameraShow;			//1
        BOOL	bPhotoShow;				//1
        BOOL	bFPShow;				//1
        BOOL	bCameraSave;			//1
        BYTE	byCameraRateForFP;		//1
        BYTE	byCameraRateForCard;	//1
        BYTE	byCameraRateForPWD;		//1
        int     nBackgroupIconFile;
        WORD    wPortNumBack;
        CHAR	szHostByName[32];
        //CHAR	szHostByName_1[32];
        //CHAR	szHostByName_2[32];
        //int		nRealSpaceTime;
        //CHAR	nHttpMachineID[20];
        CHAR	szHttpRomFileName[256];
        int		nRealSpaceTime;
        DWORD	dwDataSaveTime;
        DWORD		DNSserverIp;
} DBSETUP_SYSTEM;					//Total = 164

typedef struct _db_timesection_a
{
        BYTE	bStartHour;				//1
        BYTE	bStartMinute;			//1
        BYTE	bEndHour;				//1, In the case of bell, bell-type
        BYTE	bEndMinute;				//1, In the case of bell, bell-length
}DB_TIMESECTION_A;					//Total = 4;

typedef struct _db_tz_normal
{
        WORD NAME[TZNAME_LENGTH];	//32
        DB_TIMESECTION_A RANGE;		//4
        DWORD STATUS;				//4
}DB_TZ_NORMAL;					//Total = 40;

typedef struct _db_tz_access
{
        DB_TIMESECTION_A RANGE[7];	//28
        DWORD STATUS;
}DB_TZACCESS;					//Total = 32

typedef struct _db_tzgroup
{
        BYTE	bGroupA;				//1
        BYTE	bGroupB;				//1
        BYTE	bGroupC;				//1
        BYTE	bGroupD;				//1(reserved)
}DB_TZGROUP_A;						//Total = 4

typedef DB_TZGROUP_A DB_TZGROUP[ACCESS_USER_GROUP_COUNT]; //4 * 5 = 20

typedef struct {
        WORD	SMSID;				// 2, message ID
        BYTE	Valid;				// 1, valid
        BYTE	Tag;				// 1, message type: 0-general, 1-user, 2-group
        WORD	Belong;				// 2, user or group ID or 0(general)
        WORD	ValidMinutes;		// 2, valid period
        DWORD	StartTime;			// 4, valid period
        char	Contents[MSG_LEN];	// 60,displayed message
} MSG_INFO;						// Total = 72

typedef struct
{
        DB_TZ_NORMAL tzTr[LOG_TZONE_COUNT];			//40
        DB_TZ_NORMAL tzBell[BELL_INFO_COUNT];		//40
        DB_TZACCESS  tzAccess[ACCESS_TIME_SET_COUNT];//1600
        DB_TZGROUP   tzGroup;						//20
        BYTE		 tzLockGroup[MULTI_IDENT_SET_COUNT];//10
        BYTE		 tzGrupVM[ACCESS_USER_GROUP_COUNT];//5
        BYTE		 tzRes;							//1
        MSG_INFO	 tzMsg[MSG_INFO_COUNT];			//720
        //only for highlevel timezone function
        DB_TIMESECTION_A	tzHighTIME[TIMEZONE_COUNT];					//128
        BYTE				tzHighTG[TIMEGROUP_COUNT][TIMECOUNT_PER_TG];//320
        BYTE				tzHighAccess[ACCESS_TIME_SET_COUNT_HIGH][7];//224
}DBSETUP_TIMEZONE;								//Total = 3108

typedef struct
{
        DWORD					dwCheckSum;	//4
        DBSETUP_NOMENU			setNoMenu;	//64
        DBSETUP_SYSTEM			setSystem;	//156
        DBSETUP_TIMEZONE		setTimezone;//3108
} DBSETUP_TOTAL;						//Total = 3332

typedef struct
{
#define NAND_FLASH_MAGIC	0x19860320
        DWORD dwFlashMagic;
        //
        int   nMachineID;
        int   nBaudrate;
        BYTE  byMACaddr[8];
        DWORD ipAddress;
        DWORD ipSubnetMask;
        DWORD ipDefaultGateway;
        DWORD dwCommPassword;
        WORD  wPortNum;
        WORD  res1; //HIWORD(NAND_FLASH_MAGIC)
        //
        int   nDownloaderSize;
        int   nKernelSize;
        int   nRootfsSize;
        int   nConsoleUse;
        //
        WORD  wSplashSize;
        WORD  wSplashChecksum;
        //
        WORD  res2; //LOWORD(NAND_FLASH_MAGIC)
        WORD  wChecksum;
} T_PARAMETER_INFO; //Downloader, Application, MakeRomImage

typedef struct
{
        unsigned char* pBackgroundImage;
        unsigned short nAnimationPosX;
        unsigned short nAnimationPosY;
        unsigned short nAnimationWidth;
        unsigned short nAnimationHeight;
